vecsAreParallelApprox(XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Determines whether vectors are parallel within ANGLE_EPS
Returns: if parallel => 1
if not or if either is {0,0,0}. => 0
if antiparallel => -1